<%
	//start-----------------------------------------------------------------点播code
	 /*      
	String  dibblingMenuCode="10000100000000090000000000033290";        // 点播中的菜单code                     
	String  dibblingLeftVodCode="10000100000000090000000000031172";     //左侧四部影片
	String  dibblingCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  dibblingRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  dibblingRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  dibblingCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  dibblingCatagoryCenterCode="10000100000000090000000000033290";// 中间下栏目
	
	//end--------------------------------------------------------------- --点播code
	
	
	//start-------------------------------------------------------------------------单片详情(detail-single.jsp)code
	
    String  detailSingleVodCode="10000100000000090000000000031171";// 中间栏目  
	
	//end---------------------------------------------------------------------------单片详情(detail-single.jsp)code   
	

	//start------------------------------------------------------详情页(detail-much.jsp)cod
	
	String rightRecCode = "10000100000000090000000000031171";//连续剧详情页右侧推荐影片
	
   //end------------------------------------------------------详情页(detail-much.jsp)cod
   
   
   
   //start--------------------------------------------------------------------------金色童年(childhood.jsp)
	  	
	String  childhoodDibMenuCode="10000100000000090000000000033290";     // 点播中的菜单(点击点播弹出的子菜单)                     
	String  childhoodLeftVodCode="10000100000000090000000000031172";     //左侧四部影片
	String  childhoodCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  childhoodRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  childhoodRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  childhoodCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  childhoodCatagoryCenterCode="10000100000000090000000000033290";// 中间下栏目
	
	  
   //end----------------------------------------------------------------------------金色童年(childhood.jsp)
   
   
   // children-column.jsp 需要两个code 判断进入少儿栏目和精彩频道
   //start-------------------------------------------------------------------------children-column-detail
	String childColDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-column-detail
   
    //start-------------------------------------------------------------------------children-single-detail
	String childrenSigDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-single-detail
   
   //start-------------------------------------------------------------------------children-much-detail
	String childrenMuchDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-much-detail
   
   
   	//start-------------------------------------------------------------------------频道(channel.jsp)
	  String channelListCode = "00000100000000090000000000015840";//频道列表(area2)
    //end----------------------------------------------------------------------------频道(channel.jsp)
	*/
	
	
	//=======================================深圳code=======================================================//	


    //s----------------------------------------------------首页code
	String leftVodCode = "10000100000000090000000000031172";	//左侧四部影片
	String centerVodCode = "10000100000000090000000000031172";	//中间三影片
	String newVodCode = "10000100000000090000000000031172";		//最新上线
	String topVodCode = "10000100000000090000000000031172";		//top榜
	String recVodCode = "10000100000000090000000000031172";		//重磅推荐
	String categoryCode1 = "10000100000000090000000000033290";  //首页栏目code(area3)
	String categoryCode2 = "10000100000000090000000000033290";  //首页栏目code(area4)
	//e-------------------------------------------------------首页code

		
	//s-----------------------------------------------------------------点播code
	String newsChannelCode="10000100000000090000000000033290";//新闻频道的code;
	String HdViewCode="10000100000000090000000000033290";//高清视场的code
    String movieWorld="10000100000000090000000000033290" ;//电影天地的code;
	String TVTheatre="10000100000000090000000000033290";//电视剧场的code 
	                  
	String  dibblingLeftVodCode="10000100000000090000000000031172";     //左侧四部影片
	String  dibblingCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  dibblingRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  dibblingRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  dibblingCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  dibblingCatagoryCenterCode="10000100000000090000000000033290";// 中间下栏目
	//e--------------------------------------------------------------- --点播code
	
		
	//s-------------------------------------------------------------------------单片详情(detail-single.jsp)code
    String  detailSingleVodCode="10000100000000090000000000031171";//   右侧推荐影片
	//e---------------------------------------------------------------------------单片详情(detail-single.jsp)code   
	
	//start------------------------------------------------------详情页(detail-much.jsp)cod
	String rightRecCode = "10000100000000090000000000031171";//连续剧详情页右侧推荐影片
   //end------------------------------------------------------详情页(detail-much.jsp)cod
   
   //start--------------------------------------------------------------娱乐时尚（entertainment.jsp）
   String  entTamentleftCode="10000100000000090000000000031172" ;  //精彩节目的code;
   String  entTamentCenterUpCode="10000100000000090000000000033292";//精彩专题code
   String  entTamentCenterCode="10000100000000090000000000031172";//热门推荐
   String  entTamentCenterDownCode="10000100000000090000000000033292";//栏目code
   String  entTamentRightUpCode="10000100000000090000000000031172";//音乐MV
   String  entTamentRightDownCode="10000100000000090000000000031172";//综艺TOP榜
   //end----------------------------------------------------------------娱乐时尚（entertainment.jsp）
   
   
   //s--------------------------------------------------------------------------金色童年(childhood.jsp)         
	String  childhoodLeftVodCode="10000100000000090000000000031171";     //左侧四部影片
	String  childhoodCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  childhoodRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  childhoodRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  childhoodCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  childhoodCatagoryCenterCode="10000100000000090000000000033290";// 中间下栏目
   //e----------------------------------------------------------------------------金色童年(childhood.jsp)
   
   //s-----------------------------------------------------------------------------children.jsp
    String  ChildrenProgCode="10000100000000090000000000033312";     //少儿栏目专题
	String  ChildrenSpeciaCode="10000100000000090000000000033311";  //精彩专题
   //e-----------------------------------------------------------------------------children.sjp
   
   
   
   // children-column.jsp 需要两个code 判断进入少儿栏目和精彩频道
   //start-------------------------------------------------------------------------children-column-detail
	String childColDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-column-detail
   
    //start-------------------------------------------------------------------------children-single-detail
	String childrenSigDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-single-detail
   
   //start-------------------------------------------------------------------------children-much-detail
	String childrenMuchDetailRightCode = "10000100000000090000000000031172";
   //end----------------------------------------------------------------------------children-much-detail
   
   	//start-------------------------------------------------------------------------频道(channel.jsp)
	  String channelListCode = "00000100000000090000000000015840";//频道列表(area2)
    //end----------------------------------------------------------------------------频道(channel.jsp)
	
	//start--------------------------------------------------------------------------新闻页面(news.jsp)
	String newsLiftCode="10000100000000090000000000031172"; //左边新闻专题
	String  newsLeftCenterUpCode="10000100000000090000000000033292";  //中上三栏目
	String  newsLeftCenterCode="10000100000000090000000000031172";     //中间新闻连连看
    String  newsLeftCenterDwCode="10000100000000090000000000033292";     //中下栏目
	String  newsRightUpCode="10000100000000090000000000031172";   //右上top榜
	String  newsRightDwCode="10000100000000090000000000033292";   // 右下栏目
	//end--------------------------------------------------------------------------新闻页面(news.jsp)
	//start--------------------------------------------------------------------------新闻页面(news-list.jsp)
	
	
	
	//=============================guonei
	String newsListcategoryCode1="10000100000000090000000000031172";//国内
	String newsListcategoryCode2="10000100000000090000000000031171";//国际
	String newsListcategoryCode3="10000100000000090000000000031172";//社会
	String newsListcategoryCode4="10000100000000090000000000031171";//财经
	String newsListcategoryCode5="10000100000000090000000000031172";//军事
	String newsListcategoryCode6="10000100000000090000000000031171";//娱乐
	String newsListcategoryCode7="10000100000000090000000000031172";//体育
	
	
	
	//String newListMenuVodCode0="10000100000000090000000000003991";
	
	
	
	String newListMenuVodCode0="10000100000000090000000000031172";	
	String newListMenuVodCode1="10000100000000090000000000031172";
	String newListMenuVodCode2="10000100000000090000000000031172";
	String newListMenuVodCode3="10000100000000090000000000031172";
	String newListMenuVodCode4="10000100000000090000000000031172";		
	String newListMenuVodCode5="10000100000000090000000000031172";	
	String newListMenuVodCode6="10000100000000090000000000031172";	
	String newListMenuVodCode7="10000100000000090000000000031172";	
	String newListMenuVodCode8="10000100000000090000000000031172";	
	String newListMenuVodCode9="10000100000000090000000000031172";		
	String newListMenuVodCode10="10000100000000090000000000031172";		
	String newListMenuVodCode11="10000100000000090000000000031172";			
	String newListMenuVodCode12="10000100000000090000000000031172";			
	String newListMenuVodCode13="10000100000000090000000000031172";			
	String newListMenuVodCode14="10000100000000090000000000031172";			
	String newListMenuVodCode15="10000100000000090000000000031172";			
	String newListMenuVodCode16="10000100000000090000000000031172";			
	String newListMenuVodCode17="10000100000000090000000000031172";			
	String newListMenuVodCode18="10000100000000090000000000031172";			
	String newListMenuVodCode19="10000100000000090000000000031172";		
	String newListMenuVodCode20="10000100000000090000000000031172";			
	String newListMenuVodCode21="10000100000000090000000000031172";			
	String newListMenuVodCode22="10000100000000090000000000031172";			
	String newListMenuVodCode23="10000100000000090000000000031172";			
	String newListMenuVodCode24="10000100000000090000000000031172";			
	String newListMenuVodCode25="10000100000000090000000000031172";			
	String newListMenuVodCode26="10000100000000090000000000031172";	

	
	
	
	

	
	//end--------------------------------------------------------------------------新闻页面(news-list.jsp)
	//s----------------------------------------------------------------------------------健康生活//
	String  healthLeftVodCode="10000100000000090000000000031172";         //左侧四部影片
	String  healthCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  healthCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  healthRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  healthRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  healthCatagoryCenterCode="10000100000000090000000000033292";// 中间下栏目
	//e----------------------------------------------------------------------------------健康生活//
	
	//s----------------------------------------------------------------------------------财经视界//
	String  economicsLeftVodCode="10000100000000090000000000031172";         //左侧四部影片
	String  economicsCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  economicsCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  economicsRightDVodCode="10000100000000090000000000031172";   //右下主编推荐
	String  economicsRightUVodCode="10000100000000090000000000031172";   // 右上最新推荐
	String  economicsCatagoryCenterCode="10000100000000090000000000033292";// 中间下栏目
	//e----------------------------------------------------------------------------------财经视界//
	//s--------------------------------------------------------------------------------法治空间
	
    String  legalsysLeftVodCode="10000100000000090000000000031172";         //左边名牌栏目
	String  legalsysCatagoryCenterUpCode="10000100000000090000000000033292";// 中间三栏目
	String  legalsysCenterDVodCode="10000100000000090000000000031172";  //中下热播推荐
	String  legalsysCatagoryCenterCode="10000100000000090000000000033292";// 中间下栏目
	String  legalsysRightDVodCode="10000100000000090000000000031172";   //右下热点追踪
	String  legalsysRightUVodCode="10000100000000090000000000031172";   // 右上精彩节目
	//e---------------------------------------------------------------------------------法治空间
	
	
    //s---------------------------------------------------------------------------------第一体育
	String largeSportsCatagoryCode = "10000100000000090000000000033292";			//首页栏目
	String largeSportsRecCode = "10000100000000090000000000031172";					//首页推荐影片
	String largeSportsNewCode = "10000100000000090000000000031172";					//首页最新影片
	String bottomRecCode = "10000100000000090000000000031172";						//详情页推荐影片
	//e---------------------------------------------------------------------------------第一体育
	
	//s-----------------------------------------------------------------------------------科教记录
	String documentaryCatagoryCode = "10000100000000090000000000033292";			//首页栏目
	String documentaryLeftCode = "10000100000000090000000000031172";					//左侧三部影片
	String documentaryCenterCode = "10000100000000090000000000031172";					//中间一部影片
	String documentaryBottomCode_1 = "10000100000000090000000000031172";				//底部影片1
	String documentaryBottomCode_2 = "10000100000000090000000000031172";				//底部影片2
	String documentaryBottomCode_3 = "10000100000000090000000000031172";				//底部影片3
	String documentaryBottomCode_4 = "10000100000000090000000000031172";				//底部影片4
	//e-----------------------------------------------------------------------------------科教记录



    //s-----------------------------------------------------------------------------------专题(special-topic.jsp)
	
	
	String specialTopicCode="10000100000000090000000000033292";
	
	//e-----------------------------------------------------------------------------------
	
	//00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
	
	//=======================================四川code=======================================================//
	/*	
   //s----------------------------------------------------首页code
	String leftVodCode = "10000100000000090000000000004371";	//左侧四部影片
	String centerVodCode = "10000100000000090000000000005843";	//中间三影片
	String newVodCode = "10000100000000090000000000004371";		//最新上线
	String topVodCode = "10000100000000090000000000004372";		//top榜
	String recVodCode = "10000100000000090000000000004371";		//重磅推荐
	String categoryCode1 = "00000100000000090000000000001597";  //首页栏目code(area3)
	String categoryCode2 = "00000100000000090000000000001597";  //首页栏目code(area4)
	//e-------------------------------------------------------首页code
	
	
	
		
	//s-----------------------------------------------------------------点播code
	String newsChannelCode="10000100000000090000000000003550";//新闻频道的code;
	String HdViewCode="10000100000000090000000000004735";//高清视场的code
    String movieWorld="00000100000000090000000000001597" ;//电影天地的code;
	String TVTheatre="00000100000000090000000000001604";//电视剧场的code                   
	String  dibblingLeftVodCode="10000100000000090000000000004371";     //左侧四部影片
	String  dibblingCenterDVodCode="10000100000000090000000000004371";  //中下热播推荐
	String  dibblingRightDVodCode="10000100000000090000000000004371";   //右下主编推荐
	String  dibblingRightUVodCode="10000100000000090000000000004371";   // 右上最新推荐
	String  dibblingCatagoryCenterUpCode="10000100000000090000000000008392";// 中间三栏目
	String  dibblingCatagoryCenterCode="00000100000000090000000000001597";// 中间下栏目
	//e--------------------------------------------------------------- --点播code
	
	
		
	//s-------------------------------------------------------------------------单片详情(detail-single.jsp)code
    String  detailSingleVodCode="10000100000000090000000000004371";//   右侧推荐影片
	//e---------------------------------------------------------------------------单片详情(detail-single.jsp)code   
	

	//start------------------------------------------------------详情页(detail-much.jsp)cod
	String rightRecCode = "10000100000000090000000000005843";//连续剧详情页右侧推荐影片
   //end------------------------------------------------------详情页(detail-much.jsp)cod
   
   
   
   //start--------------------------------------------------------------娱乐时尚（entertainment.jsp）
   String  entTamentleftCode="10000100000000090000000000017597";  //精彩节目的code;
   String  entTamentCenterUpCode="10000100000000090000000000013258";//精彩专题code
   String  entTamentCenterCode="10000100000000090000000000017083";//热门推荐
   String  entTamentCenterDownCode="00000100000000090000000000001680";//栏目code
   String  entTamentRightUpCode="10000100000000090000000000007723";//音乐MV
   String  entTamentRightDownCode="10000100000000090000000000017552";//综艺TOP榜
   //end----------------------------------------------------------------娱乐时尚（entertainment.jsp）
   
   
   //s--------------------------------------------------------------------------金色童年(childhood.jsp)         
	String  childhoodLeftVodCode="10000100000000090000000000005668";     //左侧四部影片
	String  childhoodCenterDVodCode="00000100000000090000000000001650";  //中下热播推荐
	String  childhoodRightDVodCode="10000100000000090000000000011180";   //右下主编推荐
	String  childhoodRightUVodCode="10000100000000090000000000010642";   // 右上最新推荐
	String  childhoodCatagoryCenterUpCode="10000100000000090000000000006405";// 中间三栏目
	String  childhoodCatagoryCenterCode="00000100000000090000000000001649";// 中间下栏目
   //e----------------------------------------------------------------------------金色童年(childhood.jsp)
   
   
   // children-column.jsp 需要两个code 判断进入少儿栏目和精彩频道
   //start-------------------------------------------------------------------------children-column-detail
	String childColDetailRightCode = "10000100000000090000000000011036";
   //end----------------------------------------------------------------------------children-column-detail
   
    //start-------------------------------------------------------------------------children-single-detail
	String childrenSigDetailRightCode = "10000100000000090000000000010643";
   //end----------------------------------------------------------------------------children-single-detail
   
   //start-------------------------------------------------------------------------children-much-detail
	String childrenMuchDetailRightCode = "10000100000000090000000000011036";
   //end----------------------------------------------------------------------------children-much-detail
   
   	//start-------------------------------------------------------------------------频道(channel.jsp)
	  String channelListCode = "00000100000000090000000000001017";//频道列表(area2)
    //end----------------------------------------------------------------------------频道(channel.jsp)
	
	//start--------------------------------------------------------------------------新闻页面(news.jsp)
	String newsLiftCode="10000100000000090000000000006865"; //左边新闻专题
	String  newsLeftCenterUpCode="10000100000000090000000000003990";  //中上三栏目
	String  newsLeftCenterCode="10000100000000090000000000004054";     //中间新闻连连看
    String  newsLeftCenterDwCode="10000100000000090000000000003990";     //中下栏目
	String  newsRightUpCode="10000100000000090000000000006702";   //右上top榜
	String  newsRightDwCode="10000100000000090000000000003550";   // 右下栏目
	//end--------------------------------------------------------------------------新闻页面(news.jsp)
	//start--------------------------------------------------------------------------新闻页面(news-list.jsp)

	String newsListcategoryCode1="10000100000000090000000000004497";//国内
	String newsListcategoryCode2="10000100000000090000000000003789";//国际
	String newsListcategoryCode3="10000100000000090000000000003786";//社会
	String newsListcategoryCode4="10000100000000090000000000003790";//财经
	String newsListcategoryCode5="10000100000000090000000000003787";//军事
	String newsListcategoryCode6="10000100000000090000000000003788";//娱乐
	String newsListcategoryCode7="10000100000000090000000000003870";//体育
	
	
	
	
	String newListMenuVodCode0="10000100000000090000000000003991";	
	String newListMenuVodCode1="10000100000000090000000000006865";
	String newListMenuVodCode2="10000100000000090000000000006721";
	String newListMenuVodCode3="10000100000000090000000000006703";
	String newListMenuVodCode4="10000100000000090000000000004063";		
	String newListMenuVodCode5="10000100000000090000000000006704";	
	String newListMenuVodCode6="10000100000000090000000000006702";	
	String newListMenuVodCode7="10000100000000090000000000006701";	
	String newListMenuVodCode8="10000100000000090000000000006705";	
	String newListMenuVodCode9="10000100000000090000000000004054";		
	String newListMenuVodCode10="10000100000000090000000000006753";		
	String newListMenuVodCode11="10000100000000090000000000017432";			
	String newListMenuVodCode12="10000100000000090000000000017433";			
	String newListMenuVodCode13="10000100000000090000000000004056";			
	String newListMenuVodCode14="10000100000000090000000000004055";			
	String newListMenuVodCode15="10000100000000090000000000006622";			
	String newListMenuVodCode16="10000100000000090000000000006844";			
	String newListMenuVodCode17="10000100000000090000000000006623";			
	String newListMenuVodCode18="10000100000000090000000000006754";			
	String newListMenuVodCode19="10000100000000090000000000004057";		
	String newListMenuVodCode20="10000100000000090000000000004058";			
	String newListMenuVodCode21="10000100000000090000000000006755";			
	String newListMenuVodCode22="10000100000000090000000000004062";			
	String newListMenuVodCode23="10000100000000090000000000004060";			
	String newListMenuVodCode24="10000100000000090000000000004061";			
	String newListMenuVodCode25="10000100000000090000000000004065";			
	String newListMenuVodCode26="10000100000000090000000000011215";	
	
	
	
	//end--------------------------------------------------------------------------新闻页面(news-list.jsp)
	//s----------------------------------------------------------------------------------健康生活//
	String  healthLeftVodCode="10000100000000090000000000004371";         //左侧四部影片
	String  healthCatagoryCenterUpCode="10000100000000090000000000008392";// 中间三栏目
	String  healthCenterDVodCode="10000100000000090000000000004371";  //中下热播推荐
	String  healthRightDVodCode="10000100000000090000000000004371";   //右下主编推荐
	String  healthRightUVodCode="10000100000000090000000000004371";   // 右上最新推荐
	String  healthCatagoryCenterCode="00000100000000090000000000001597";// 中间下栏目
	//e----------------------------------------------------------------------------------健康生活//
	
	//s----------------------------------------------------------------------------------财经视界//
	String  economicsLeftVodCode="10000100000000090000000000004371";         //左侧四部影片
	String  economicsCatagoryCenterUpCode="10000100000000090000000000008392";// 中间三栏目
	String  economicsCenterDVodCode="10000100000000090000000000004371";  //中下热播推荐
	String  economicsRightDVodCode="10000100000000090000000000004371";   //右下主编推荐
	String  economicsRightUVodCode="10000100000000090000000000004371";   // 右上最新推荐
	String  economicsCatagoryCenterCode="00000100000000090000000000001597";// 中间下栏目
	//e----------------------------------------------------------------------------------财经视界//
	//s--------------------------------------------------------------------------------法治空间
	
    String  legalsysLeftVodCode="10000100000000090000000000008955";         //左边名牌栏目
	String  legalsysCatagoryCenterUpCode="00000100000000090000000000001731";// 中间三栏目
	String  legalsysCenterDVodCode="10000100000000090000000000007962";  //中下热播推荐
	String  legalsysCatagoryCenterCode="10000100000000090000000000006761";// 中间下栏目
	String  legalsysRightDVodCode="10000100000000090000000000004371";   //右下热点追踪
	String  legalsysRightUVodCode="10000100000000090000000000004371";   // 右上精彩节目
	//e---------------------------------------------------------------------------------法治空间
  
   //s---------------------------------------------------------------------------------第一体育
	String largeSportsCatagoryCode = "00000100000000090000000000001705";			//首页栏目
	String largeSportsRecCode = "10000100000000090000000000017536";					//首页推荐影片
	String largeSportsNewCode = "10000100000000090000000000015317";					//首页最新影片
	String bottomRecCode = "10000100000000090000000000014375";						//详情页推荐影片
	//e---------------------------------------------------------------------------------第一体育
	
	//s-----------------------------------------------------------------------------------科教记录
	String documentaryCatagoryCode = "00000100000000090000000000001629";			//首页栏目
	String documentaryLeftCode = "10000100000000090000000000014399";					//左侧三部影片
	String documentaryCenterCode = "10000100000000090000000000006744";					//中间一部影片
	String documentaryBottomCode_1 = "10000100000000090000000000010575";				//底部影片1
	String documentaryBottomCode_2 = "10000100000000090000000000006781";				//底部影片2
	String documentaryBottomCode_3 = "10000100000000090000000000006744";				//底部影片3
	String documentaryBottomCode_4 = "10000100000000090000000000006744";				//底部影片4
	//e-----------------------------------------------------------------------------------科教记录
	
	 //s-----------------------------------------------------------------------------------专题(special-topic.jsp)
	String specialTopicCode="10000100000000090000000000011215";
	//e-----------------------------------------------------------------------------------
	
*/
	
%>