<%@ page contentType="text/html; charset =UTF-8" pageEncoding="UTF-8"%>
<%@ page import="com.huawei.iptvmw.epg.bean.TurnPage" %>
<%@ page import="com.huawei.iptvmw.epg.util.EPGSysParam"%>
<%@ page import="com.huawei.iptvmw.epg.util.EPGConstants"%>
<%@ include file = "../../../keyboard_A2/keydefine.jsp" %>
<%@ include file="datajsp/util_AdText.jsp"%>
<html>
<%
    //页面跳转
    TurnPage turnPage = new TurnPage(request);  
    String returnUrl = "";    
    if (request.getParameter("backurl") != null && !"".equals(request.getParameter("backurl")) && !"null".equals(request.getParameter("backurl"))) 
    {
    	returnUrl = request.getParameter("backurl");
    }
    else
    {
        //returnUrl = turnPage.go(0);
		returnUrl = "index.jsp";
    }
%>
<head>
<title>errorinfo</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link rel="stylesheet" type="text/css" href="../css/style.css" />
<style type="text/css">
    body {
        background: #0d4764 url("../images/body-page-only-bg-1.jpg") no-repeat;
    }
    .mod-pop-box {
        background: url("../images/pop-432x218-1.png") no-repeat;
        height: 218px;
        width: 432px;
        position: absolute;
        left: 104px;
        top: 142px;
    }
    .mod-pop-box .txt {
        font-size: 20px;
        height: 24px;
        text-align: center;
        width: 432px;
    }
</style>
</head>
<script>
<!--
document.onkeypress = Keyevent;
function Keyevent()
{
	var val = event.which;
	return keypress(val);
}
function goBack()
{	
	window.location.href = "<%=returnUrl%>";	
}
function keypress(keyval)
{
	switch(keyval)
	{
		case <%=KEY_BACKSPACE%>://回退键和返回键同样处理       
		case <%=KEY_RETURN%>:
		case <%=KEY_OK%>:
			 goBack();
			return 0;
		default :
				break; 
	}
	return 1;
}
function auto_return()
{
	tempTime=  setTimeout("returnCategory();",10000);
}

function returnCategory()
{
   clearTimeout(tempTime);
   window.location.href = "<%=returnUrl%>";	
}
-->
</script>
<%!

    //信息内容定义
    protected String[][] info = new String[][]
    {
        //001
        {
            "系统产生未知错误。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1000"
        },
        //002
        {
			"数据传输失败。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1001"
        },
		 //003
        {
            "此用户不存在，或者用户名/密码为空。",
			"此用户不存在，或者用户名/密码为空。",
			"请输入正确的用户名和密码，如果问题依然存在，联系服务提供商。",
			"错误ID：1500"
        },
		 //004
        {
            "此用户已经暂停使用。",
			"此用户已经暂停使用。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1501"
        },
           //005
        {
            "Subscriberstatuserror.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1502"
        },        
            
        //006
        {
           "Thesubscriberdoesnotexist.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1503"
        },            
                        
        //007
        {
            "Subscriber status anomaly.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1504"
        },
                
        //008
        {
            "Subscriber/Password error.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1505"
        },
                
        //009
        {
            "The subscriber cancels the authentication.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1506"
        },
        
        //010
        {
            "The format of the packet is incorrect.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1507"
        },
        
        //011
        {
            "Verification shows that the data is incorrect.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1508"
        },
        
        //012
        {
           "修改密码失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1002"
        },  
        
        //013
        {
            "修改密码成功。",
			"操作成功。",
			"请按返回键，返回到上一菜单。",""
        },  
        
        //014
        {
            "设置父母锁成功。",
			"操作成功。",
			"请按返回键，返回到上一菜单。",""
        },  
                
        //015
        {
            "设置父母锁失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1509"
        },
         //016
        {
            "密码确认与新密码不一致。",
			"密码确认与新密码不一致。",
			"按返回键到上一级菜单。","错误ID：1003"
        },
        
        //017
        {
            "新密码长度不超过12位。",
			"新密码长度不超过12位。",
			"按返回键到上一级菜单。","错误ID：1004"
        },
        
        //018
        {
            "旧密码错误。",
			"旧密码错误。",
			"按返回键到上一级菜单。","错误ID：1510"
        },  
        
        //019
        {
            "密码错误。",
			"密码错误。",
			"按返回键到上一级菜单。","错误ID：1005"
        },
        
        //020
        {
            "获取电影URL失败。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1006"
        },
        
        //021
        {
            "搜索关键字不允许为空。",
			"搜索关键字不允许为空。",
			"按返回键到上一级菜单。","错误ID：1007"
        },
        
        //022
        {
            "此直播不可用。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1008"
        },
                
        //023
        {
            "没有有效的子类别。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1009"
        },
        
        //024
        {
            "电影URL错误。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1511"
        },
        
        //025
        {
            "没有可用的内容。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1010"
        },
        
        //026
        {
            "此直播暂时无法播放。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1011"
        },    
        //027
        {
            "授权失败。",
			"订购失败。",
			"请按返回键，返回到上一菜单。","错误ID：1512"
        },  
        //028
        {
            "暂无可用直播。",
			"暂无可用直播。",
			"请拨打中国电信客户服务热线10000号咨询。","错误ID：1012"
        },
		
        //029
        {
            "The subscriber ID token cannot be null.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1513"
        },
		
        //030
        {
            "The subscriber ID token is invalid.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1514"
        },
		 
        //031
        {
            "The subscriber ID token times out.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1515"
        }, 
		
        //032
        {
            "节目尚未开始。",
			"节目尚未开始。",
			"请选择其他节目。","错误ID：1013"
        }, 
		     
        //033
        {
            "The service is stopped.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1516"
        },
		
        //034
        {
            "登录超时。",
			"登录超时。",
			"请按菜单键重新登录。","错误ID：1517"
        },
        //035
        {
            "The subscriber is unauthorized to auto reorder the product.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1518"
        },
		
        //036
        {
            "订购失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1014"
        },
		
        //037
        {
            "The balance is insufficient.",
			"您的余额不足。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1519"
        },
		      
        //038
        {
            "The subscriber cancels the payment.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1520"
        },
		
        //039
        {
            "The subscription failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1521"
        },
		
        //040
        {
            "The subscription succeeded.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1522"
        },
		//041
        {
            "没有热点电影。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1523"
        },
		
        //042
        {
            "No programs to be removed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1524"
        },
		
        //043
        {
            "No the latest programs.",
			"暂无内容",
			"按返回键重新选择。","错误ID：1525"
        },
        
         //044
        {
            "清空收藏失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1015"
        },
		
        //045
        {
            "添加收藏夹失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1016"
        },
        
        //046
        {
            "获取电影信息失败。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1017"
        },
		
        //047
        {
            "The VOD history is null.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1526"
        },
		
        //048
        {
            "电影已过期。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1018"
        },
		
        //049
        {
            "父母控制级别修改成功。",
			"操作成功。",
			"请按返回键，返回到上一菜单。",""
        },
        
        //050
        {
            "父母控制级别修改失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1528"
        },
        
        //051
        {
            "密码不能包含空格。",
			"密码不能包含空格。",
			"按返回键到上一级菜单。","错误ID：1529"
        },      
        
        //052
        {
            "旧密码不能为空。",
			"旧密码不能为空。",
			"按返回键到上一级菜单。","错误ID：1019"
        },
        
        //053
        {
            "新密码不能为空。",
			"新密码不能为空。",
			"按返回键到上一级菜单。","错误ID：1020"
        },
        
        //054
        {
            "密码确认不能为空。",
			"密码确认不能为空。",
			"按返回键到上一级菜单。","错误ID：1021"
        },
		
        //055
        {
            "搜索条件不能为空。",
			"搜索条件不能为空。",
			"按返回键到上一级菜单。","错误ID：1530"
        },
                
        //056
        {
            "The network bandwidth is insufficient.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1022"
        },

        //057
        {
            "No content is available in \"My Favorite\".",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1531"
        },
		
        //058
        {
            "No CDR is found.",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1532"
        },
		
        //059
        {
            "添加收藏失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1023"
        },
		
        //060
        {
            "登录超时。",
			"登录超时。",
			"按菜单重新登录。","错误ID：1024"
        },
		
        //061
        {
            "The subscriber authentication failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1533"
        },
		
        //062
        {
            "您的输入存在非法字符。",
			"您的输入存在非法字符。",
			"您的输入只允许以下字符：\"0-9\",\"a-z\",\"A-Z\",\".\",\"@\",\"?\",\"...\"。<br>按返回键到上一级菜单。","错误ID：1025"
        },
		 //063
        {
            "密码不能为空。",
			"密码不能为空。",
			"按返回键到上一级菜单。","错误ID：1026"
        },
		
        //064
        {
            "Query failed because the no space is available for the play list.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1534"
        },
		
        //065
        {
            "Failed to query skins.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1535"
        },
        
        //066
        {
            "此界面风格不需要切换。",
			"此界面风格不需要切换。",
			"请按返回键，返回到上一菜单。","错误ID：1536"
        },
		
        //067
        {
            "界面风格信息不存在。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1537"
        },
		
        //068
        {
            "界面风格切换失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1538"
        },
		
        //069
        {
            "界面风格切换失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1539"
        },
        
        //070
        {
            "播放流不存在或电影已过期。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1027"
        },
		
        //071
        {
            "Failed to modify the Parental control.",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1540"
        },
		
        //072
        {
            "Querying CDRs failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1541"
        },
        
        //073
        {
            "切换语言失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1542"
        },
        
        //074
        {
            "首映专区中不能配置二级栏目.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1543"
        },
        
        //075
        {
            "节目或类别锁定失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1544"
        },
        
        //076
        {
            "No content is available in \"My Lock\".",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1545"
        },
        
        //077
        {
            "收藏电影删除失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1028"
        },
        
        //078
        { 
            "取消定购成功。",
			"操作成功。",
			"请按返回键，返回到上一菜单。",""
        },
        
        //079
        {   
			"非自动续订的产品不能被取消。",
			"该产品不允许退订或取消。",
			"请按返回键，返回到上一菜单。","错误ID：1547"
        },
        
        //080
        {
            "没有可订购产品。",
			"没有可订购产品。",
			"请返回后重试，如果问题依然存在，请联系服务提供商。","错误ID：1029"
        },
        
        //081
        {
            "Querying order failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1548"
        },
        
		//082
		{
		    "Querying the movie ID failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1549"
		},
		
        //083
        {
            "旧密码错误。",
			"旧密码错误。",
			"按返回键到上一级菜单。","错误ID：1030"
        },
        
        //084
        {
            "没有有效的书签电影。",
			"没有有效的书签电影。",
			"按返回键到上一级菜单。","错误ID：1031"
        },
        
        //085
        {
            "搜索关键字不允许只包含空格。",
			"搜索关键字不允许只包含空格。",
			"按返回键到上一级菜单。","错误ID：1032"
        },
        
        //086
        {
            "此电影不存在。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1033"
        },
        
        //087
        {
            "密码修改失败。",
			"密码修改失败。服务器正忙。",
			"请返回后重试，如果问题依然存在，请联系服务提供商。","错误ID：1034"
        },
        
        //088
        {
            "您的输入存在非法字符。",
			"您的输入存在非法字符。",
			"您的输入不支持如下字符:'<','>','\\','\"','\'','%','_','#','&','+'。按返回键到上一级菜单。","错误ID：1550"
        },
        
        //089
        {
            "查询订购失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1551"
        },
        
        //090
        {
            "取消定购失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1552"
        },
		 //091
        {
            "您的输入包含非法字符。",
			"您的输入包含非法字符。",
			"您只能输入下列字符：<br>0-9,a-z,A-Z,<br>.空格和@。<br>按返回键到上一级菜单。","错误ID：1553"
        },
		 //092
        {
        	"Time out or network error while connect to ACS.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1035"
        },
        //093
        {   
			"Can not cancel this program now.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1554"
        },
        //094
        {
            "Get PPV program failed,can not subscribe this program.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1555"
        },
        //095
        {
            "This program has been ordered,but not reach the time.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1556"
        },
       
        //096
        {
            "增值服务已过期。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1557"
        },
        //097
        {
            "增值服务不存在。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1036"
        } ,
        //098
        {
            "This product can not been cancel automatic reorder,you may ordered next month program.",
			"该产品不允许退订或取消。",
			"按返回键到上一级菜单。","错误ID：1558"
        },
        //099
        {
            "该节目不支持订购。",
			"该节目不支持订购。",
			"按返回键到上一级菜单。","错误ID：1559"
        },
        //100
        {
            "现在不提供trailer服务。",
			"现在不提供trailer服务。",
			"按返回键到上一级菜单。","错误ID：1037"
        },
        //101
        {
          	"产品已经订购。",
			"产品已经订购。",
			"按返回键到上一级菜单。","错误ID：1038"
        },
        //102
        {
            "Cancel this program failed.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1560"
        },
        //103
        {
            "This record not exist,or has been cancelled successfully.",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1561"
        },
		//104
        {
            "没有下线电影。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1039"
        },
		//105
        {
            "暂无节目单。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1562"
        },
		//106
        {
            "暂不提供此服务。",
			"暂不提供此服务。",
			"按返回键重新选择。","错误ID：1563"
        },
		//107
        {
            "暂无聚场。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1564"
        },
		//108
        {
            "暂无节目单。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1565"
        },
		//109
		{
			"节目尚未开始。",
			"节目尚未开始。",
			"按返回键重新选择。","错误ID：1040"
		},
		//110
        {
            "没有最新电影。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1041"
        },
		//111
        {
            "没有一周排行电影。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1042"
        },
		//112
        {
            "没有今日更新电影。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1043"
        },
		//113
        {
            "暂无节目单。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1566"
        },
		//114
		{
			"你选择的影片无在线订购服务。",
			"你选择的影片无在线订购服务。",
			"按返回键重新选择。","错误ID：1567"
		},
        //115
        {
            "片花不存在或已经过期。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1044"
        },
        //116
        {
        	"参数不正确。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1568"
        },
        //117
        {
        	"没有检索到相应数据。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1045"
        },
		 //118
        {
        	"添加书签失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1046"
        },
		 //119
        {
        	"删除书签失败。",
			"操作失败。",
			"请按返回键，返回到上一菜单。","错误ID：1047"
        },
		 //120
        {
        	"书签个数已达上限。",
			"书签个数已达上限，请删除原有书签后再添加。",
			"请按返回键，返回到上一菜单。","错误ID：1048"
        },
		 //121
        {
        	"该用户不支持在线订购。",
			"用户不支持在线订购。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1569"
        },
		 //122
        {
        	"产品将下线，不支持订购。",
			"产品将下线，不支持订购。",
			"请按返回键，返回到上一菜单。","错误ID：1049"
        }
		,
		 //123
        {
        	"该连续剧没子集。",
			"暂无内容。",
			"按返回键重新选择。","错误ID：1050"
        }
		,
		 //124
        {
        	"添加书签成功。",
			"操作成功。",
			"请按返回键，返回到上一菜单。",""
        },
		 //125
        {
        	 "产品不存在或状态不可用。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1051"
        },
		 //126
        {
        	"服务不存在或状态不可用。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1052"
        },
		 //127
        {
        	"订购的产品不在使用期内。",
			"订购的产品不在使用期内。",
			"请按返回键，返回到上一菜单。","错误ID：1053"
        }
		,
		 //128
        {
        	"此直播是高清直播，机顶盒暂不支持高清播放。",
			"此节目是高清节目，机顶盒暂不支持高清播放。",
			"请按返回键，返回到上一菜单。","错误ID：1054"
        },
		 //129
        {
        	"此视频是高清视频，机顶盒暂不支持高清播放。",
			"此节目是高清节目，机顶盒暂不支持高清播放。",
			"请按返回键，返回到上一菜单。","错误ID：1055"
        },
		 //130
        {
        	"节目录制失败。",
			"节目录制失败。",
			"按返回键重新选择。","错误ID：1056"
        },
		//131
		{
        	"暂无该直播。",
			"暂无该直播。",
			"按返回键重新选择。","错误ID：1057"
        },
		//132
		{
        	"此直播暂时无法播放。",
			"暂时无法观看。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1570"
        }
		,
		 //133
        {
        	"该直播未订购。",
			"该直播未订购。",
			"请按返回键，返回到上一菜单。","错误ID：1571"
        }
		,
		 //134
        {
        	"该栏目尚未创建。",
			"该栏目尚未创建。",
			"请按返回键，返回到上一菜单。","错误ID：1572"
        },
		//135
        {
			"处理失败，缺省错误码。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1058"
        },
		//136
        {
        	"用户没有订购相应产品或订购关系已失效或未生效。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1059"
        },
		//137
        {
			"缺省错误码。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1060"
        },
		//138
        {
        	"扩展信息解析错误。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1061"
        },
		//139
        {
        	"自动续订标志错误。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1062"
        },
		//140
        {
			"产品不存在或产品未激活。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1063"
        },
		//141
        {
         	"影片价格未定义",
			"影片价格未定义",
			"请按返回键，返回到上一菜单。","错误ID：1064"
        },
		//142
        {
        	"余额已不足,请及时充值。",
			"余额已不足,请及时充值。",
			"请按返回键，返回到上一菜单。","错误ID：1065"
        },
		//143
        {
        	"扣费处理失败,请稍候再试。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1066"
        },
		//144
        {
        	"订购级别不够。",
			"订购级别不够。",
			"请按返回键，返回到上一菜单。","错误ID：1067"
        },
		//145
        {
        	"内容不存在。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1068"
        },
		//146
        {
        	"包月产品不允许订购/退订基本包产品。",
			"该产品不允许退订或取消。",
			"请按返回键，返回到上一菜单。","错误ID：1069"
        },
		//147
        {
        	"订购结束时间不能小于系统当前时间。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1070"
        },
		//148
        {
        	"业务类型不存在。",
			"授权失败。",
			"请按返回键，返回到上一菜单。","错误ID：1071"
        },
		//149
        {
        	"内容类型不存在。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1072"
        },
		//150
        {
        	"订购/退订处理失败（数据库异常）。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1073"
        },
		//151
        {
        	"该用户不支持在线订购。",
			"该用户不支持在线订购。",
			"请按返回键，返回到上一菜单。","错误ID：1074"
        }
		,
		//152
        {
        	"暂无可订购产品。",
			"暂无可订购产品。",
			"请按返回键，返回到上一菜单。","错误ID：1075"
        },
		//153
        {
        	"浏览器出现异常，无法启动播放。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1076"
        },
		//154
        {
        	"暂无可订购产品。",
			"暂无可订购产品。",
			"请按返回键，返回到上一菜单。","错误ID：1077"
        },
		//155
        {
        	"数据库异常。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1078"
        },
		//156
        {
        	"操作超时。",
			"操作超时。",
			"请按返回键，返回到上一菜单。","错误ID：1079"
        },
		//157
        {
        	"用户已暂停、用户不存在或非法用户。",
			"用户已暂停、用户不存在或非法用户。",
			"如果问题依然存在，请联系服务提供商！。","错误ID：1080"
        },
		//158
        {
        	"用户令牌非法。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1081"
        },
		//159
        {
        	"传入的参数错误。",
			"暂不支持订购。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1082"
        },
		//160
		{
        	"网络异常。",
			"服务器错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。","错误ID：1083"
        },
		//161
		{
        	"重复订购未过期产品，订购失败（租用记录）。",
			"重复订购未过期产品，订购失败。",
			"请按返回键，返回到上一菜单。","错误ID：1084"
        },
		//162
		{
        	"不能订购该产品，请到营业厅办理或者拨打10000号咨询。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1085"
        },
		//163
		{
        	"没有订购，请联系运营商订购。",
			"没有订购，请联系运营商订购。",
			"请按返回键，返回到上一菜单。","错误ID：1086"
        }
		,//164
		{
        	"积分不够,或用户积分为0，或产品不支持积分订购。",
			"积分不够,或用户积分为0，或产品不支持积分订购。",
			"请按返回键，返回到上一菜单。","错误ID：1573"
        }
		,//165
		{
        	"该影片已经过期，请删除。",
			"该影片已经过期，请删除。",
			"请按返回键，返回到上一菜单。","错误ID：1087"
        }
		,//166
		{
        	"用户积分点数不够。",
			"用户积分点数不够。",
			"请按返回键，返回到上一菜单。","错误ID：1088"
        }
		,//167
		{
        	"产品不支持积分订购。",
			"产品不支持积分订购。",
			"请按返回键，返回到上一菜单。","错误ID：1089"
        }
		,//168
		{
        	"积分订购处理失败。",
			"订购失败。",
			"请到营业厅办理或者拨打10000号咨询。","错误ID：1090"
        }
		,//169
		{
        	"不允许退订积分订购的产品。",
			"该产品不允许退订或取消。",
			"请按返回键，返回到上一菜单。","错误ID：1091"
        }
		,//170
		{
        	"不允许用积分续订产品。",
			"不允许用积分续订产品。",
			"请按返回键，返回到上一菜单。","错误ID：1092"
        }
		,//171
		{
        	"系统忙，请稍后重试。",
			"系统忙，请稍后重试。",
			"请按返回键，返回到上一菜单。","错误ID：1093"
        }
		,//172
		{
        	"背景音乐已打开。",
			"背景音乐已打开。",
			"请按返回键，返回到上一菜单。",""
        }
		,//173
		{
        	"背景音乐已关闭。",
			"背景音乐已关闭。",
			"请按返回键，返回到上一菜单。",""
        }
		,//174
		{
        	"TVMS消息url不存在或已过期。",
			"内容不存在或已过期。",
			"请选择其他内容。","错误ID：1094"
        }
		,//175
		{
        	"产品不支持现金订购。",
			"产品不支持现金订购。",
			"请按返回键，返回到上一菜单。","错误ID：1095"
        }
		,//176
		{
        	"无订购记录。",
			"无订购记录。",
			"请按返回键，返回到上一菜单。","错误ID：1096"
        }
		,//177
        {
        	"用户未订购此产品或该产品已被取消订购。",
			"该产品不允许退订或取消。",
			"请按返回键，返回到上一菜单。","错误ID：1097"
        }
    ,//178
		{
        	"产品不支持IPTV积分订购。",
			"产品不支持IPTV积分订购。",
			"请按返回键，返回到上一菜单。","错误ID：1098"
        }
		,//179
		{
        	"产品不支持电信积分订购。",
			"产品不支持电信积分订购。",
			"请按返回键，返回到上一菜单。","错误ID：1099"
        }
		,//180
        {
			"回放地址获取异常，中间件接口抛异常。",
			"回放配置错误。",
			"请稍候重试，如果问题依然存在，联系服务提供商。",
			"错误ID：1100"
        }
	};
%>
<%
String strErrorID = null;
String errorType = null;
String resolve = null;

int iErrorID = 1;
int ierrorType=1;

strErrorID = (String)request.getParameter("ERROR_ID");
errorType = (String)request.getParameter("ERROR_TYPE");

if(errorType != null && !errorType.equals(""))
{
	ierrorType = Integer.parseInt(errorType);
}
if( ierrorType < 1 || ierrorType >4)
{
	ierrorType = 2;
}

if(strErrorID != null && !strErrorID.equals(""))
{
	iErrorID = Integer.parseInt(strErrorID);
}
else
{
	iErrorID = 1;
}
if( iErrorID < 1 || iErrorID > info.length)
{
	iErrorID = 1;
}
String desc = info[iErrorID-1][0];
String errorId = info[iErrorID-1][3];
resolve =  info[iErrorID-1][2];
%>
<body onLoad="javascript:auto_return()">

<div class="wrapper">
    <div class="mod-pop-box">
        <div class="txt" style="top:67px;"><%=desc%></div>
        <div class="txt" style="top:95px;">请按遥控器"首页"返回界面</div>
        <div class="txt" style="top:125px;">如果不成功请联系运营商</div>
    </div>
</div>

</body>
</html>
